mattsousaa/STM32Fxxx_HAL/BkupSRAM_Standby/Core/Src/main.c
/*
 * main.c
 *
 *  Created on: 30 de Junho de 2020
 *      Author: Mateus Sousa
 */

#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include <stdarg.h>
#include "stm32f4xx_hal.h"
#include "main.h"

void GPIO_Init(void);
void Error_handler(void);
void UART2_Init(void);
void SystemClock_Config_HSE(uint8_t clock_freq);
void GPIO_AnalogConfig(void);

UART_HandleTypeDef huart2;

void printmsg(char *format, ...){

	char str[80];

	/*Extract the the argument list using VA apis */
	va_list args;
	va_start(args, format);
	vsprintf(str, format, args);
	HAL_UART_Transmit(&huart2, (uint8_t*) str, strlen(str), HAL_MAX_DELAY);
	va_end(args);

}

int main(void) {

	uint32_t *pBackupSRAMbase = 0;

	char write_buf[] = "Hello";

	HAL_Init();

	GPIO_Init();

	SystemClock_Config_HSE(SYS_CLOCK_FREQ_50_MHZ);

	UART2_Init();

	//1. Turn on the clock in RCC register for backup sram
	__HAL_RCC_BKPSRAM_CLK_ENABLE();

	//2. Enable Write access to the backup domain
	__HAL_RCC_PWR_CLK_ENABLE();
	HAL_PWR_EnableBkUpAccess();

	pBackupSRAMbase = (uint32_t*)BKPSRAM_BASE;

	// Enable clock for PWR Controller block
	__HAL_RCC_PWR_CLK_ENABLE();

	// Find out the cause for reset
	if(__HAL_PWR_GET_FLAG(PWR_FLAG_SB) != RESET){	// Device has been in Standby mode
		// Reset was actually caused due to the Standby mode
		__HAL_PWR_CLEAR_FLAG(PWR_FLAG_SB); // Cleared by the software
		__HAL_PWR_CLEAR_FLAG(PWR_FLAG_WU); // Clear the Wakeup flag caused by wakeup pin

		printmsg("woke up from the standby mode\r\n");
		uint8_t data = (uint8_t) *pBackupSRAMbase;

		if(data != 'H'){ // If backup voltage regulator is not set, then the backup SRAM data will be lost
			printmsg("Backup SRAM data is lost\r\n");
		} else{
			printmsg("Backup SRAM data is safe \r\n");
		}

	} else{
		for(uint32_t i = 0; i < strlen(write_buf) + 1; i++){
			*(pBackupSRAMbase + i) = write_buf[i];
		}
	}

	printmsg("Press the user button to enter standby mode\r\n");
	while(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13) != GPIO_PIN_RESET);

	// When user pushes the user button, it comes here
	printmsg("Going to Standby mode\r\n");

	// Enable the wakeup pin 1 in pwr_csr register
	HAL_PWR_EnableWakeUpPin(PWR_WAKEUP_PIN1);

	// Enable backup voltage reg. in order to preserve the contents of the backup SRAM even if the micro is sleeping in Standby mode
	HAL_PWREx_EnableBkUpReg();

	// When the micro wakes up from the Stand By mode it undergoes system reset
	HAL_PWR_EnterSTANDBYMode();

	// It will not resume from here.
	// That means a reset handler will run and from there it will execute the main again

	while(1);

	return 0;
}



/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config_HSE(uint8_t clock_freq){

	RCC_OscInitTypeDef Osc_Init;
	RCC_ClkInitTypeDef Clock_Init;
	uint8_t flash_latency = 0;

	Osc_Init.OscillatorType = RCC_OSCILLATORTYPE_HSE;
	Osc_Init.HSEState = RCC_HSE_ON;
	Osc_Init.PLL.PLLState = RCC_PLL_ON;
	Osc_Init.PLL.PLLSource = RCC_PLLSOURCE_HSE;

	switch (clock_freq) {
	case SYS_CLOCK_FREQ_50_MHZ:
		Osc_Init.PLL.PLLM = 4;
		Osc_Init.PLL.PLLN = 50;
		Osc_Init.PLL.PLLP = RCC_PLLP_DIV2;
		Osc_Init.PLL.PLLQ = 2;
		Osc_Init.PLL.PLLR = 2;
		Clock_Init.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
				| RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
		Clock_Init.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
		Clock_Init.AHBCLKDivider = RCC_SYSCLK_DIV1;
		Clock_Init.APB1CLKDivider = RCC_HCLK_DIV2;
		Clock_Init.APB2CLKDivider = RCC_HCLK_DIV1;
		flash_latency = 1;
		break;

	case SYS_CLOCK_FREQ_84_MHZ:
		Osc_Init.PLL.PLLM = 4;
		Osc_Init.PLL.PLLN = 84;
		Osc_Init.PLL.PLLP = RCC_PLLP_DIV2;
		Osc_Init.PLL.PLLQ = 2;
		Osc_Init.PLL.PLLR = 2;
		Clock_Init.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
				| RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
		Clock_Init.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
		Clock_Init.AHBCLKDivider = RCC_SYSCLK_DIV1;
		Clock_Init.APB1CLKDivider = RCC_HCLK_DIV2;
		Clock_Init.APB2CLKDivider = RCC_HCLK_DIV1;
		flash_latency = 2;
		break;

	case SYS_CLOCK_FREQ_120_MHZ:
		Osc_Init.PLL.PLLM = 4;
		Osc_Init.PLL.PLLN = 120;
		Osc_Init.PLL.PLLP = RCC_PLLP_DIV2;
		Osc_Init.PLL.PLLQ = 2;
		Osc_Init.PLL.PLLR = 2;
		Clock_Init.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
				| RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
		Clock_Init.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
		Clock_Init.AHBCLKDivider = RCC_SYSCLK_DIV1;
		Clock_Init.APB1CLKDivider = RCC_HCLK_DIV4;
		Clock_Init.APB2CLKDivider = RCC_HCLK_DIV2;
		flash_latency = 3;
		break;

	default:
		return;
	}

	if(HAL_RCC_OscConfig(&Osc_Init) != HAL_OK){
		Error_handler();
	}

	if(HAL_RCC_ClockConfig(&Clock_Init, flash_latency) != HAL_OK){
		Error_handler();
	}

	/*Configure the systick timer interrupt frequency (for every 1 ms) */
	uint32_t hclk_freq = HAL_RCC_GetHCLKFreq();
	HAL_SYSTICK_Config(hclk_freq / 1000);

	/**Configure the Systick
	 */
	HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

	/* SysTick_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);

}

void GPIO_Init(void){

	__HAL_RCC_GPIOA_CLK_ENABLE();
	__HAL_RCC_GPIOC_CLK_ENABLE();

	GPIO_InitTypeDef ledgpio, buttongpio;

	ledgpio.Pin = GPIO_PIN_5;
	ledgpio.Mode = GPIO_MODE_OUTPUT_PP;
	ledgpio.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(GPIOA, &ledgpio);

	buttongpio.Pin = GPIO_PIN_13;
	buttongpio.Mode = GPIO_MODE_IT_FALLING;
	buttongpio.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(GPIOC, &buttongpio);

	HAL_NVIC_SetPriority(EXTI15_10_IRQn, 15, 0);
	HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);

}

void UART2_Init(void){

	huart2.Instance = USART2;
	huart2.Init.BaudRate = 115200;
	huart2.Init.WordLength = UART_WORDLENGTH_8B;
	huart2.Init.StopBits = UART_STOPBITS_1;
	huart2.Init.Parity = UART_PARITY_NONE;
	huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	huart2.Init.Mode = UART_MODE_TX;

	if(HAL_UART_Init(&huart2) != HAL_OK){
		//There is a problem
		Error_handler();
	}

}

void Error_handler(void){
	while(1);
}
